000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КартаТревог/КартаТревог.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КартаТревог</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>НазваниеТерритории</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ТипТерритории</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипТревоги</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>КодТерритории</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Магазины/Магазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Магазины</name>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВЭксплуатацию</name>
    <comment>Магазин переведен в режим работы 1С:Розница</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМинимальныхЦенПродажи</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПользователей</name>
    <type>
      <types>CatalogRef.ГруппыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФизЛиц</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРаботы</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтгрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриОтраженииИзлишковНедостач</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПеремещении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОрдернуюСхемуПриПоступлении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрименениеЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрямуюИнкассацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КассаМагазина</name>
    <comment>Основная денежная касса магазина</comment>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБюджета</name>
    <type>
      <types>CatalogRef.КодыБюджетов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <comment>Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьАссортимент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерМагазина</name>
    <comment>Используется для начальной загрузки из MForce</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделениеОрганизации</name>
    <comment>Определяет филиал</comment>
    <type>
      <types>CatalogRef.ОбособленныеПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменаРучныхСкидок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерсональныеПродажи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подпись</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругленияСуммыЧекаВПользуПокупателя</name>
    <type>
      <types>EnumRef.ПорядкиОкругления</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоЦенообразования</name>
    <type>
      <types>CatalogRef.ПравилаЦенообразования</types>
    </type>
  </attributes>
  <attributes>
    <name>СегментИсключаемойНоменклатуры</name>
    <type>
      <types>CatalogRef.СегментыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПереброски</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПоступления</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПродажи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладСвязи</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладУправляющейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматМагазина</name>
    <type>
      <types>CatalogRef.ФорматыМагазинов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ОбменДаннымиСервисТревог/Module.bsl
Функция ПолучитьПараметрыПодключения()
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("Сервер","api.alerts.in.ua");
	ПараметрыПодключения.Вставить("Порт",443);
	ПараметрыПодключения.Вставить("Токен","36619877bb75f990fb6545b89bb6c15752fbd73aab2203"); 
	ПараметрыПодключения.Вставить("Ресурс","/v1/alerts/active.json"); 
	
	Возврат ПараметрыПодключения;
КонецФункции

Функция ПолучитьАктивныеТревоги() Экспорт
	ПараметрыПодключения = ПолучитьПараметрыПодключения();
	ХТТПСоединение = Новый HTTPСоединение(ПараметрыПодключения.Сервер,ПараметрыПодключения.Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	ХТТПЗапрос = Новый HTTPЗапрос(ПараметрыПодключения.Ресурс);
	ХТТПЗапрос.Заголовки.Вставить("Authorization", "Bearer "+ПараметрыПодключения.Токен);
	ХТТПОтвет = ХТТПСоединение.Получить(ХТТПЗапрос);
	Если ХТТПОтвет.КодСостояния <> 200 Тогда
		Возврат Новый Структура("Успешно,КодСостояния,ОписаниеОшибки",Ложь,ХТТПОтвет.КодСостояния,ХТТПОтвет.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
	СтруктураОтвета = ОбменWebRetailСервер.ТекстДЖСОНвСтруктуру(ХТТПОтвет.ПолучитьТелоКакСтроку()); 
	
	Возврат СтруктураОтвета;
КонецФункции

Функция ПолучитьИсториюТревогПоТерритории(КодТерритории)
	ПараметрыПодключения = ПолучитьПараметрыПодключения();
	ХТТПСоединение = Новый HTTPСоединение(ПараметрыПодключения.Сервер,ПараметрыПодключения.Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	ХТТПЗапрос = Новый HTTPЗапрос("/v1/regions/"+СтрЗаменить(КодТерритории,Символы.НПП,"")+"/alerts/month_ago.json");
	ХТТПЗапрос.Заголовки.Вставить("Authorization", "Bearer "+ПараметрыПодключения.Токен);
	ХТТПОтвет = ХТТПСоединение.Получить(ХТТПЗапрос);
	Если ХТТПОтвет.КодСостояния <> 200 Тогда
		Возврат Новый Структура("Успешно,КодСостояния,ОписаниеОшибки",Ложь,ХТТПОтвет.КодСостояния,ХТТПОтвет.ПолучитьТелоКакСтроку());
	КонецЕсли;
	
	СтруктураОтвета = ОбменWebRetailСервер.ТекстДЖСОНвСтруктуру(ХТТПОтвет.ПолучитьТелоКакСтроку()); 
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ПолучитьИсториюТревогЗаМесяц() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Магазины.Город КАК Город,
	               |	Магазины.Город.КодТерритории КАК КодТерритории
	               |ИЗ
	               |	Справочник.Магазины КАК Магазины
	               |ГДЕ
	               |	Магазины.Блокирован = ЛОЖЬ
	               |	И Магазины.ВведенВЭксплуатацию = ИСТИНА
	               |	И Магазины.Город.КодТерритории > 0"; 
	Рез_ = Запрос.Выполнить().Выбрать();
	Пока Рез_.Следующий() Цикл
		СтруктураОтвета = ПолучитьИсториюТревогПоТерритории(Рез_.КодТерритории);
		ЗаписатьКартуТревог(СтруктураОтвета);	
	КонецЦикла;
	
	
КонецФункции

Функция ПолучитьНезакрытуюЗапись(СтруктураТревоги)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	               |	КартаТревог.Период КАК Период,
	               |	КартаТревог.КодТерритории КАК КодТерритории,
	               |	КартаТревог.НазваниеТерритории КАК НазваниеТерритории,
	               |	КартаТревог.ДатаОкончания КАК ДатаОкончания,
	               |	КартаТревог.ТипТерритории КАК ТипТерритории,
	               |	КартаТревог.ТипТревоги КАК ТипТревоги,
	               |	КартаТревог.Примечание КАК Примечание
	               |ИЗ
	               |	РегистрСведений.КартаТревог КАК КартаТревог
	               |ГДЕ
	               |	КартаТревог.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	               |	И КартаТревог.КодТерритории = &КодТерритории";
	Запрос.УстановитьПараметр("КодТерритории", СтруктураТревоги.location_uid);
	Рез =	Запрос.Выполнить().Выбрать();
	Если Рез.Следующий() Тогда
		СтруктураОтвета = Новый Структура("КодТерритории,Период");
		ЗаполнитьЗначенияСвойств(СтруктураОтвета,Рез);
		Возврат СтруктураОтвета;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ЗаписатьКартуТревог(СтруктураОтвета) Экспорт 
	Если ТипЗнч(СтруктураОтвета)<> Тип("Структура") 
		ИЛИ Не СтруктураОтвета.Свойство("alerts")
		ИЛИ ТипЗнч(СтруктураОтвета.alerts)<>Тип("Массив")
			Тогда    
			ЗаписьЖурналаРегистрации("КартаТревог",УровеньЖурналаРегистрации.Ошибка,,,"Возвращен неизвестный формат ответа");
		Возврат;
	КонецЕсли;
		
	Для Каждого СтрокаОтвета Из СтруктураОтвета.alerts Цикл
		//2026-07-27 sa видимо в какой-то момент в API карты тревог немного поменялся формат (начали дополнительно разделять районы и области), что стало приводить к 
		//наложении тревог друг на друга в регистре. Поправим.
		СтруктураТекЗаписи = ПолучитьНезакрытуюЗапись(СтрокаОтвета);

		Рег_ = РегистрыСведений.КартаТревог.СоздатьНаборЗаписей();
		Рег_.Отбор.КодТерритории.Установить(ПолучитьЧисло(СтрокаОтвета.location_uid));

		Если СтруктураТекЗаписи = Неопределено Тогда
			Рег_.Отбор.Период.Установить(ПреобразоватьВДату(СтрокаОтвета.started_at));
		Иначе
			Рег_.Отбор.Период.Установить(СтруктураТекЗаписи.Период);
		КонецЕсли;
		Рег_.Прочитать();
		
		Если Рег_.Количество() > 0 Тогда
			СтрокаКартыТревог = Рег_[0];
		Иначе
			СтрокаКартыТревог = Рег_.Добавить(); 
		КонецЕсли;
		
		СтрокаКартыТревог.КодТерритории = СтрокаОтвета.location_uid;
		СтрокаКартыТревог.НазваниеТерритории = СтрокаОтвета.location_title;
		СтрокаКартыТревог.Период = ПреобразоватьВДату(СтрокаОтвета.started_at);
		Если Не ЗначениеЗаполнено(СтрокаОтвета.finished_at) Тогда
			СтрокаКартыТревог.ДатаОкончания = ТекущаяДата();
		Иначе
			СтрокаКартыТревог.ДатаОкончания = ПреобразоватьВДату(СтрокаОтвета.finished_at); 
		КонецЕсли;
		СтрокаКартыТревог.ТипТерритории = СтрокаОтвета.location_type;
		СтрокаКартыТревог.ТипТревоги = СтрокаОтвета.alert_type;
		СтрокаКартыТревог.Примечание = СтрокаОтвета.notes;
		Рег_.Записать(Истина);
	КонецЦикла;
	
	
КонецПроцедуры   

Процедура ОбновитьКартуТревог() Экспорт 
	СтруктураОтвета = ПолучитьАктивныеТревоги();
	ЗаписатьКартуТревог(СтруктураОтвета);
КонецПроцедуры

Функция ПолучитьЧисло(СтрЧисло)
	Если ТипЗнч(СтрЧисло) = Тип("Число") Тогда
		Возврат СтрЧисло;
	Иначе
		СтрЧисло = СтрЗаменить(СтрЧисло," ","");
		Попытка 
			Число_ = Число(СтрЧисло);
		Исключение
			Сообщить("Не вдалося перетворити на число: "+СтрЧисло);
			Число_ = 0;	
		КонецПопытки;

		Возврат Число_;
		
	КонецЕсли;
КонецФункции

Функция ПреобразоватьВДату(СтрДата)
	//Ожидаем дату в формате 2023-10-29T18:22:37.357Z
	СтрДата = СтрЗаменить(СтрДата,"-","");
	СтрДата = СтрЗаменить(СтрДата,"T","");
	СтрДата = СтрЗаменить(СтрДата,":","");
	СтрДата = Лев(СтрДата,14);
	Попытка
		Дата_ = Дата(СтрДата);
	Исключение
		Сообщить("Не вдалося перетворити на дату: "+СтрДата);
		Дата_ = Дата("00010101");
	КонецПопытки;
	
	Возврат Дата_;

КонецФункции
